In [2]:
ls1 = [1,2,3]
ls2 = [3,5,7]
ls3 = [6,5,4]

In [5]:
list(map(lambda x, y, z : x + y + z, ls1, ls2, ls3))

[10, 12, 14]

In [7]:
list(zip(ls1, ls2, ls3))

[(1, 3, 6), (2, 5, 5), (3, 7, 4)]

In [11]:
def map_func(func,  *args):
    return [func(*datas) for datas in zip(*args) ]

In [13]:
map_func(lambda x, y, z : x + y + z, ls1, ls2, ls3)

[10, 12, 14]

In [15]:
import numpy as np

In [51]:
np.random.seed(0) ; np.random.rand(3)

array([0.5488135 , 0.71518937, 0.60276338])

In [60]:
import numpy as np
import pandas as pd

In [61]:
np.random.seed(0)
data = pd.Series(np.random.randint(1, 10, size=5), index = list('ABCDE'))

In [62]:
data

A    6
B    1
C    4
D    4
E    8
dtype: int32

In [63]:
result = data + 2

In [64]:
result['B'] = 10

In [65]:
result = result +3

In [66]:
result['B']

13

In [69]:
from pandas import Series, DataFrame

raw_data = {'Sex': ['female', 'male', 'female', 'male'],
            'Pclass': [1, 2, 3, 1],
            'counts': [94, 52, 144, 122]}

data = DataFrame(raw_data)

In [70]:
data

      Sex  Pclass  counts
0  female       1      94
1    male       2      52
2  female       3     144
3    male       1     122

In [73]:
df = data.pivot('Pclass', 'Sex', 'counts')

'''
Signature: data.pivot(index=None, columns=None, values=None) -> 'DataFrame'
Docstring:
'''

"\nSignature: data.pivot(index=None, columns=None, values=None) -> 'DataFrame'\nDocstring:\n"

In [74]:
df

Sex     female   male
Pclass
1         94.0  122.0
2          NaN   52.0
3        144.0    NaN

In [98]:
class Myclass:
    def __init__(self, a):
        self.a = a

In [99]:
c1 = Myclass("test")
print(c1.a)

test

In [100]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'name': ['Manchester City', 'Manchester United', 'Tottenham Hotspur',
       'Liverpool', 'Chelsea', 'Arsenal', 'Burnley', 'Everton',
       'Leicester City', 'Newcastle United', 'Crystal Palace',
       'Bournemouth', 'West Ham United', 'Watford',
       'Brighton and Hove Albion', 'Huddersfield Town', 'Southampton',
       'Swansea City', 'Stoke City', 'West Bromwich Albion'],
    'gf': [106,  68,  74,  84,  62,  74,  36,  44,  56,  39,  45,  45,  48,
        44,  34,  28,  37,  28,  35,  31],
    'ga': [27, 28, 36, 38, 38, 51, 39, 58, 60, 47, 55, 61, 68, 64, 54, 58, 56,
       56, 68, 56],
    'points': [100,  81,  77,  75,  70,  63,  54,  49,  47,  44,  44,  44,  42,
        41,  40,  37,  36,  33,  33,  31]
                                                                   
})
df

                        name   gf  ga  points
0            Manchester City  106  27     100
1          Manchester United   68  28      81
2          Tottenham Hotspur   74  36      77
3                  Liverpool   84  38      75
4                    Chelsea   62  38      70
5                    Arsenal   74  51      63
6                    Burnley   36  39      54
7                    Everton   44  58      49
8             Leicester City   56  60      47
9           Newcastle United   39  47      44
10            Crystal Palace   45  55      44
11               Bournemouth   45  61      44
12           West Ham United   48  68      42
13                   Watford   44  64      41
14  Brighton and Hove Albion   34  54      40
15         Huddersfield Town   28  58      37
16               Southampton   37  56      36
17              Swansea City   28  56      33
18                Stoke City   35  68      33
19      West Bromwich Albion   31  56      31

In [ ]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'name': ['Manchester City', 'Manchester United', 'Tottenham Hotspur',
       'Liverpool', 'Chelsea', 'Arsenal', 'Burnley', 'Everton',
       'Leicester City', 'Newcastle United', 'Crystal Palace',
       'Bournemouth', 'West Ham United', 'Watford',
       'Brighton and Hove Albion', 'Huddersfield Town', 'Southampton',
       'Swansea City', 'Stoke City', 'West Bromwich Albion'],
    'gf': [106,  68,  74,  84,  62,  74,  36,  44,  56,  39,  45,  45,  48,
        44,  34,  28,  37,  28,  35,  31],
    'ga': [27, 28, 36, 38, 38, 51, 39, 58, 60, 47, 55, 61, 68, 64, 54, 58, 56,
       56, 68, 56],
    'points': [100,  81,  77,  75,  70,  63,  54,  49,  47,  44,  44,  44,  42,
        41,  40,  37,  36,  33,  33,  31]
                                                                   
})
df